	ЗАДАЧА
	Входная строка
Напишите программу, которая считывает строку текста и записывает её в текстовый файл output.txt.
Формат входных данных
На вход программе подается строка текста.
Формат выходных данных
Программа должна создать файл с именем output.txt и записать в него считанную строку текста.
Примечание. Считайте, что исполняемая программа и указанный файл находятся в одной папке.

	РЕШЕНИЕ
with open('output.txt', 'w', encoding='UTF-8') as file:
    st = input()
    file.write(st)

	ЗАДАЧА
Случайные числа
Напишите программу, записывающую в текстовый файл random.txt 25 случайных чисел в диапазоне от 111 до 777 (включительно), 
каждое с новой строки.
Формат входных данных
На вход программе ничего не подается.
Формат выходных данных
Программа должна создать файл с именем random.txt и записать в него случайные числа в соответствии с условием задачи.
Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
Примечание 2. Для генерации случайных чисел используйте модуль random.

	РЕШЕНИЕ
from random import randint
with open('random.txt', 'w', encoding='UTF-8') as file:
    sp = [str(randint(111, 778)) +'\n' for i in range(25)]
    file.writelines(sp)

	ЗАДАЧА
Нумерация строк
Вам доступен текстовый файл input.txt, состоящий из нескольких строк. Напишите программу для записи содержимого этого файла в файл output.txt 
в виде нумерованного списка, где перед каждой строкой стоит ее номер, символ ) и пробел. Нумерация строк должна начинаться с 1.
Формат входных данных
На вход программе ничего не подается.
Формат выходных данных
Программа должна создать файл с именем output.txt и записать в него пронумерованные строки файла input.txt.
Примечание 1. Считайте, что исполняемая программа и указанные файлы находятся в одной папке.
Примечание 2. Используйте встроенную функцию enumerate().

	РЕШЕНИЕ
with open(r'input.txt', encoding='UTF-8') as fl, open('output.txt', 'w', encoding='UTF-8') as file2:
        sp = [c.strip() for c in fl.readlines()]
        for i, v in enumerate(sp):
            print(f'{i + 1}) {v}', file=file2)
