				ЗАДАЧА:
			Standard American Convention
На вход программе подаётся натуральное число. Напишите программу, которая вставляет в заданное число запятые в соответствии 
со стандартным американским соглашением о запятых в больших числах.

Формат входных данных
На вход программе подаётся натуральное число  n,(0<n<10*100)

Формат выходных данных
Программа должна вывести число с запятыми в соответствии с условием задачи.

				РЕШЕНИЕ:
def Standard_American_Convention(a):
    b = [i for i in reversed(a)]
    if len(b) > 3:
        c = list()
        for i in range(1,len(b) + 1):
            c.append(b[i - 1])
            if i % 3 == 0 and i != len(b):
                c.append(',')
        return ''.join(c[::-1])
    else:
        return int(a)
print(Standard_American_Convention(input()))

				ЗАДАЧА:
				Зодиак

Китайский гороскоп назначает животным годы в 12-летнем цикле. Один 12-летний цикл показан в таблице ниже. Таким образом, 
2012 год будет очередным годом дракона.

Год	Животное
2000	Дракон
2001	Змея
2002	Лошадь
2003	Овца
2004	Обезьяна
2005	Петух
2006	Собака
2007	Свинья
2008	Крыса
2009	Бык
2010	Тигр
2011	Заяц
Напишите программу, которая считывает год и отображает название связанного с ним животного. Ваша программа должна корректно работать
с любым годом, не только теми, что перечислены в таблице.
Формат входных данных
На вход программе подается одно целое число – год.
Формат выходных данных
Программа должна вывести текст – название животного.

					РЕШЕНИЕ:
def animal_year(a):
    animal = ['Обезьяна', 'Петух', 'Собака', 'Свинья', 'Крыса', 'Бык', 'Тигр',
          'Заяц', 'Дракон', 'Змея', 'Лошадь', 'Овца']
    for i in range(len(animal)):
        if a % 12 == i:
            return animal[i]
            break
print(animal_year(int(input())))
