				ЗАДАЧА:
			Переворот числа
Дано пятизначное или шестизначное натуральное число. Напишите программу, которая изменит порядок его последних пяти цифр на обратный.
Формат входных данных
На вход программе подается одно натуральное пятизначное или шестизначное число.
Формат выходных данных
Программа должна вывести число, которое получится в результате разворота, указанного в условии задачи. Число нужно выводить без незначащих нулей.

				РЕШЕНИЕ:
def int_reflection(a):
    if len(a) == 5:
        b = [i for i in reversed(a)]
        for i in range(len(b)):
            if b[i] == '0':
                continue
            else:
                return ''.join(b[i:])

    else:
        x = [i for i in reversed(a)]
        return a[0] + ''.join(x[:len(x) - 1])
print(int_reflection(input()))

				ЗАДАЧА:
				Зодиак

Китайский гороскоп назначает животным годы в 12-летнем цикле. Один 12-летний цикл показан в таблице ниже. Таким образом, 
2012 год будет очередным годом дракона.

Год	Животное
2000	Дракон
2001	Змея
2002	Лошадь
2003	Овца
2004	Обезьяна
2005	Петух
2006	Собака
2007	Свинья
2008	Крыса
2009	Бык
2010	Тигр
2011	Заяц
Напишите программу, которая считывает год и отображает название связанного с ним животного. Ваша программа должна корректно работать
с любым годом, не только теми, что перечислены в таблице.
Формат входных данных
На вход программе подается одно целое число – год.
Формат выходных данных
Программа должна вывести текст – название животного.

					РЕШЕНИЕ:
def animal_year(a):
    animal = ['Обезьяна', 'Петух', 'Собака', 'Свинья', 'Крыса', 'Бык', 'Тигр',
          'Заяц', 'Дракон', 'Змея', 'Лошадь', 'Овца']
    for i in range(len(animal)):
        if a % 12 == i:
            return animal[i]
            break
print(animal_year(int(input())))
